;;; kkh-rgts.el --- RGTs (Romaji Gokan Tanda shikaban) for kkh.el  -*- lexical-binding: t; -*-

;; Copyright (C) 2025  YUSE Yosihiro

;; Author: YUSE Yosihiro <yoyuse@gmail.com>
;; Keywords: input method, Japanese

;; This program is free software; you can redistribute it and/or modify
;; it under the terms of the GNU General Public License as published by
;; the Free Software Foundation, either version 3 of the License, or
;; (at your option) any later version.

;; This program is distributed in the hope that it will be useful,
;; but WITHOUT ANY WARRANTY; without even the implied warranty of
;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
;; GNU General Public License for more details.

;; You should have received a copy of the GNU General Public License
;; along with this program.  If not, see <https://www.gnu.org/licenses/>.

;;; Commentary:

;; - RGT(ローマ字互換単打)による日本語入力の効率化 #AZIK - Qiita
;; - https://qiita.com/dulunoj/items/95ebe5e40031183c5eea
;;
;; - MS-IME ローマ字仮名変換表 - 作成支援ツール
;; - http://jgrammar.life.coocan.jp/ja/tools/imekeys.htm#Jacql
;;
;; - 香月配列
;; - https://layout.kachoufuugetu.net/tsuki/qwerty/index.html

;;; History:

;; * 2025-09-08 私家版-11
;; - っけ(xq) を追加 (※ 私家版-3 の仕様の復活)
;;
;; * 2025-09-04 私家版-10
;; - roman 由来のルールを一部変更
;;   - 削除:
;;     - ラ行(l[aiueo]) リャ行(ly[aueo])
;;     - う(wu)
;;     - ジャ行(jy[aueo])
;;     - し(shi) ち(chi) つ(tsu) っ(xtu)
;;     - でぇ(dye) どぉ(dyo)
;;   - 変更:
;;     - ゐ(wi) → うぃ(wi) ゐ(wyi)
;;     - ゑ(we) → うぇ(we) ゑ(wye)
;;     - くゎ(kwa) → くぁ(kwa)
;;     - ぐゎ(gwa) → ぐぁ(gwa)
;;     - うぃ(xwi) → うぃ(whi) うぃ(wi)
;;     - うぇ(xwe) → うぇ(whe) うぇ(we)
;;     - うぉ(xwo) → うぉ(who)
;;     - てぃ(tyi) → てぃ(thi)
;;     - でぃ(dyi) → でぃ(dhi)
;;     - どぅ(dyu) → どぅ(dwu)
;;   - 追加:
;;     - ヂャ行(dy[aueo])
;;     - てゅ(thu) とぅ(twu)
;;     - でゅ(dhu)
;;     - ふゅ(fyu) ヴゅ(vyu) くゎ(qwa)
;;
;; * 2025-08-27 私家版-9
;; - 単打(半)母音を削除 (※ 私家版-6,7 の変更の取り消し)
;; - 遅延区切り定義を削除 (※ 私家版-3,4 の変更の取り消し)
;;
;; * 2025-08-26 私家版-8
;; - でい(dq) → であ(dq) と変更
;;
;; * 2025-08-22 私家版-7
;; - 単打(半)母音の配置替え:
;;   - あ(1) よ(2) え(3) ゆ(4) わ(5) う(7) い(8) お(9) や(0)
;;
;; * 2025-08-21 私家版-6
;; - 単打(半)母音を追加 (他の単打かなの直後でのみ使える):
;;   - や(1) よ(2) ゆ(4) わ(5) え(6) う(7) い(8) お(9) あ(0)
;;
;; * 2025-08-20 私家版-5
;; - き(y) きょ(yq) を追加
;; - 遅延区切り定義を修正・追加: しひ(shi;) しはい(shi;;) など
;;
;; * 2025-08-19 私家版-4
;; - っけ(xq) を削除, っ(xtu) を追加 (※ 私家版-3 の変更の取り消し)
;; - 遅延区切り定義を追加: かわいい(k;waii) を かわいい(kwa;ii) で入力できる
;;
;; * 2025-08-17 私家版-3
;; - っけ(xq) を追加: ヶ(xke) との衝突を回避するため
;; - っ(xtu) を削除: っつ(xtu) との衝突を回避するため
;;
;; * 2025-08-16 私家版-2
;; - るい(rq) を追加
;; - にょ(vq) → にゅ(vq) と変更
;; - q-記号を追加
;;
;; * 2025-08-15 私家版-1
;; - kkh.el での最初の実装
;; - 単打と母音等の区切りには (SPC でなく) semicolon (;) を使用
;; - 促音 (っ) には (同じ子音の連打ではなく) x による定義のみを採用
;; - ん(n;) を追加 (ん(n') に加えて)
;; - 単打に続く q をワイルドカード的に使う
;;   - たい でい がい はい かい てい ない まい (tq dq gq hq kq zq bq mq)
;;   - こう とう のう すう くう (pq fq jq lq cq)
;;   - しょ にょ (sq vq)

;;; Code:

(require 'kkh)

(kkh-define-layout
 '("rgts"
   "RGTs"
   "RGTs (ローマ字互換単打 私家版)

  1 2 3 4 5 6 7 8 9 0 - = \\ `
  q w e r t y u i o p [ ]
  a s d f g h j k l ; '
  z x c v b n m , . /

  1 2 3 4 5 6 7 8 9 0 - = \\ `
  q をe るたきu i o こ「」
  a しでとがはのかす; '
  てっくになんま、。・

- 基本はローマ字入力
  > きほん(kihon)

- 単打でかなを入力
  > かな(kb) です(dl) ました(mst)

- 促音 (っ) は x で入力する. 同じ子音の連続で入力することはできない
  > けっか(kexk)

- 単打に母音や y などが続く時は ; で区切る (私家版仕様)
  > かんい(kan;i) しよう(s;you)

- 単打に続く q は い う などになる (私家版拡張)

  - ア段・エ段の単打に続く時は い
    > たい(tq) がい(gq) はい(hq) かい(kq) てい(zq) ない(bq) まい(mq)

  - ウ段・オ段の単打に続く時は う
    > こう(pq) とう(fq) のう(jq) すう(lq) くう(cq)

  - 例外
    > るい(rq) きょ(yq) しょ(sq) であ(dq) っけ(xq) にゅ(vq)
"

   (( "a" "あ") ( "i" "い") ( "u" "う") ( "e" "え") ( "o" "お")
    ("ka" "か") ("ki" "き") ("ku" "く") ("ke" "け") ("ko" "こ")
    ("sa" "さ") ("si" "し") ("su" "す") ("se" "せ") ("so" "そ")
    ("ta" "た") ("ti" "ち") ("tu" "つ") ("te" "て") ("to" "と")
    ("na" "な") ("ni" "に") ("nu" "ぬ") ("ne" "ね") ("no" "の")
    ("ha" "は") ("hi" "ひ") ("hu" "ふ") ("he" "へ") ("ho" "ほ")
    ("ma" "ま") ("mi" "み") ("mu" "む") ("me" "め") ("mo" "も")
    ("ya" "や")             ("yu" "ゆ")             ("yo" "よ")
    ("ra" "ら") ("ri" "り") ("ru" "る") ("re" "れ") ("ro" "ろ")
    ;; ("la" "ら") ("li" "り") ("lu" "る") ("le" "れ") ("lo" "ろ")
    ;; ("wa" "わ") ("wi" "ゐ") ("wu" "う") ("we" "ゑ") ("wo" "を")
    ("wa" "わ") ("wi" "うぃ")         ("we" "うぇ") ("wo" "を")
    ("n'" "ん")
    ("ga" "が") ("gi" "ぎ") ("gu" "ぐ") ("ge" "げ") ("go" "ご")
    ("za" "ざ") ("zi" "じ") ("zu" "ず") ("ze" "ぜ") ("zo" "ぞ")
    ("da" "だ") ("di" "ぢ") ("du" "づ") ("de" "で") ("do" "ど")
    ("ba" "ば") ("bi" "び") ("bu" "ぶ") ("be" "べ") ("bo" "ぼ")
    ("pa" "ぱ") ("pi" "ぴ") ("pu" "ぷ") ("pe" "ぺ") ("po" "ぽ")

    ("kya" "きゃ") ("kyu" "きゅ") ("kye" "きぇ") ("kyo" "きょ")
    ("sya" "しゃ") ("syu" "しゅ") ("sye" "しぇ") ("syo" "しょ")
    ("sha" "しゃ") ("shu" "しゅ") ("she" "しぇ") ("sho" "しょ")
    ("cha" "ちゃ") ("chu" "ちゅ") ("che" "ちぇ") ("cho" "ちょ")
    ("tya" "ちゃ") ("tyu" "ちゅ") ("tye" "ちぇ") ("tyo" "ちょ")
    ("nya" "にゃ") ("nyu" "にゅ") ("nye" "にぇ") ("nyo" "にょ")
    ("hya" "ひゃ") ("hyu" "ひゅ") ("hye" "ひぇ") ("hyo" "ひょ")
    ("mya" "みゃ") ("myu" "みゅ") ("mye" "みぇ") ("myo" "みょ")
    ("rya" "りゃ") ("ryu" "りゅ") ("rye" "りぇ") ("ryo" "りょ")
    ;; ("lya" "りゃ") ("lyu" "りゅ") ("lye" "りぇ") ("lyo" "りょ")
    ("gya" "ぎゃ") ("gyu" "ぎゅ") ("gye" "ぎぇ") ("gyo" "ぎょ")
    ("zya" "じゃ") ("zyu" "じゅ") ("zye" "じぇ") ("zyo" "じょ")
    ;; ("jya" "じゃ") ("jyu" "じゅ") ("jye" "じぇ") ("jyo" "じょ")
    ( "ja" "じゃ") ( "ju" "じゅ") ( "je" "じぇ") ( "jo" "じょ")
    ("dya" "ぢゃ") ("dyu" "ぢゅ") ("dye" "ぢぇ") ("dyo" "ぢょ")
    ("bya" "びゃ") ("byu" "びゅ") ("bye" "びぇ") ("byo" "びょ")
    ("pya" "ぴゃ") ("pyu" "ぴゅ") ("pye" "ぴぇ") ("pyo" "ぴょ")

    ;; ("kwa" "くゎ") ("kwi" "くぃ") ("kwe" "くぇ") ("kwo" "くぉ")
    ("kwa" "くぁ") ("kwi" "くぃ") ("kwe" "くぇ") ("kwo" "くぉ")
    ("tsa" "つぁ") ("tsi" "つぃ") ("tse" "つぇ") ("tso" "つぉ")
    ( "fa" "ふぁ") ( "fi" "ふぃ") ( "fe" "ふぇ") ( "fo" "ふぉ")
    ;; ("gwa" "ぐゎ") ("gwi" "ぐぃ") ("gwe" "ぐぇ") ("gwo" "ぐぉ")
    ("gwa" "ぐぁ") ("gwi" "ぐぃ") ("gwe" "ぐぇ") ("gwo" "ぐぉ")

    ;; ("dyi" "でぃ") ("dyu" "どぅ") ("dye" "でぇ") ("dyo" "どぉ")
    ;; ("xwi" "うぃ")                ("xwe" "うぇ") ("xwo" "うぉ")

    ;; ("shi" "し") ("tyi" "てぃ") ("chi" "ち") ("tsu" "つ")
    ("ji" "じ") ("fu"  "ふ") ("ye" "いぇ") ("who" "うぉ")
    ("whi" "うぃ") ("whe" "うぇ")       ; XXX

    ("va" "ヴぁ") ("vi" "ヴぃ") ("vu" "ヴ") ("ve" "ヴぇ") ("vo" "ヴぉ")

    ("xa"  "ぁ") ("xi"  "ぃ") ("xu"  "ぅ") ("xe"  "ぇ") ("xo"  "ぉ")
    ;; ("xtu" "っ")
    ("xya" "ゃ") ("xyu" "ゅ") ("xyo" "ょ") ("xwa" "ゎ")
    ("xka" "ヵ") ("xke" "ヶ")

    ("wyi" "ゐ") ("wye" "ゑ")
    ("thi" "てぃ") ("thu" "てゅ") ("twu" "とぅ")
    ("dhi" "でぃ") ("dhu" "でゅ") ("dwu" "どぅ")
    ("fyu" "ふゅ") ("vyu" "ヴゅ") ("qwa" "くゎ")

    ;; ("1" "１") ("2" "２") ("3" "３") ("4" "４") ("5" "５")
    ;; ("6" "６") ("7" "７") ("8" "８") ("9" "９") ("0" "０")

    ;; ("!" "！") ("@" "＠") ("#" "＃") ("$" "＄") ("%" "％")
    ;; ("^" "＾") ("&" "＆") ("*" "＊") ("(" "（") (")" "）")
    ;; ("-" "ー") ("=" "＝") ("`" "｀") ("\\" "￥") ("|" "｜")
    ;; ("_" "＿") ("+" "＋") ("~" "￣") ("[" "「") ("]" "」")
    ;; ("{" "｛") ("}" "｝") (":" "：") (";" "；") ("\""  "”")
    ;; ("'" "’") ("." "。") ("," "、") ("<" "＜") (">" "＞")
    ;; ("?" "？") ("/" "／")

    ("n" "ん")

    ("-" "ー") ("[" "「") ("]" "」") ("." "。") ("," "、")
    ("/" "・")

    ("w" "を") ("r" "る") ("t" "た") ("s" "し") ("d" "で")
    ("g" "が") ("h" "は") ("k" "か") ("m" "ま")
    ("y" "き") ("p" "こ") ("f" "と") ("j" "の") ("l" "す") ("z" "て")
    ("x" "っ") ("c" "く") ("v" "に") ("b" "な")

    ("w;" "を") ("r;" "る") ("t;" "た") ("s;" "し") ("d;" "で")
    ("g;" "が") ("h;" "は") ("k;" "か") ("m;" "ま")
    ("y;" "き") ("p;" "こ") ("f;" "と") ("j;" "の") ("l;" "す") ("z;" "て")
    ("x;" "っ") ("c;" "く") ("v;" "に") ("b;" "な")

    ;; 私家版
    ("n;" "ん")
    ;; ("wq" "を")
                  ("rq" "るい") ("tq" "たい") ("sq" "しょ") ("dq" "であ")
    ("gq" "がい") ("hq" "はい") ("kq" "かい") ("mq" "まい")
    ("yq" "きょ")
    ("pq" "こう") ("fq" "とう") ("jq" "のう") ("lq" "すう") ("zq" "てい")
    ("xq" "っけ") ("cq" "くう") ("vq" "にゅ") ("bq" "ない")

    ;; 私家版 記号
    ("q1" "○") ("q!" "●")
    ("q2" "▽") ("q@" "▼")
    ("q3" "△") ("q#" "▲")
    ("q4" "□") ("q$" "■")
    ("q5" "◇") ("q%" "◆")
    ("q6" "☆") ("q^" "★")
    ("q7" "◎") ("q&" "£")
    ("q8" "¢") ("q*" "×")
    ("q9" "♂") ("q(" "【")
    ("q0" "♀") ("q)" "】")
    ("q-" "〜") ("q_" "∴")
    ("q=" "≠") ("q+" "±")
    ("q\\" "＼") ("q|" "‖")
    ("q`" "´") ("q~" "¨")

    ;; ("zq" "《") ("zQ" "〈")
    ;; ("zw" "》") ("zW" "〉")
    ("qq" "’") ("qQ" "”")
    ("qr" "々") ("qR" "仝")
    ("qt" "〆") ("qT" "§")
    ("qp" "〒") ("qP" "↑")
    ("q[" "『") ("q{" "〔")
    ("q]" "』") ("q}" "〕")

    ("qs" "ヽ") ("qS" "ヾ")
    ("qd" "ゝ") ("qD" "ゞ")
    ("qf" "〃") ("qF" "→")
    ("qg" "‐") ("qG" "—")
    ("qh" "←")
    ("qj" "↓")
    ("qk" "↑")
    ("ql" "→")
    ("q;" "゛") ("q:" "゜")
    ("q'" "‘") ("q\"" "“")

    ;; ("zx" "’") ("zX" "”")
    ("qz" "《") ("qZ" "〈")
    ("qx" "》") ("qX" "〉")
    ("qc" "〇") ("qC" "℃")
    ("qv" "※") ("qV" "÷")
    ("qb" "°") ("qB" "←")
    ("qn" "′") ("qN" "↓")
    ("qm" "″") ("qM" "〓")
    ("q," "‥") ("q<" "≦")
    ("q." "…") ("q>" "≧")
    ("q/" "・") ("q?" "∞")
    )))

(provide 'kkh-rgts)
;;; kkh-rgts.el ends here
